Repository: Mofsy/wc-robokassa
Catalog: languages/wc-robokassa-*.po
Languages: ru_ru

source: Press %s (go to payment gateway settings).
ru_ru: Нажмите %s (для перехода к настройкам платежного шлюза).

source: Useful information
ru_ru: Полезная информация

source: Official plugin page
ru_ru: Официальная страница

source: Related news: ROBOKASSA
ru_ru: Новости по теме Робокасса

source: Plugins for WooCommerce
ru_ru: Плагины для WooCommerce

source: Errors not found. Payment acceptance is active.
ru_ru: Ошибки не найдены. Прием платежей активен.

source: Warnings found. They are highlighted in yellow. You should attention to them.
ru_ru: Найдены предупреждения. Они выделены желтым цветом. Нужно обратить на них внимание.

source: Critical errors were detected. They are highlighted in red. Payment acceptance is not active.
ru_ru: Были обнаружены критические ошибки. Они выделены красным цветом. Прием платежей не активен.

source: Status
ru_ru: Состояние

source: Alfa-Click
ru_ru: Альфа-клик

source: BINBANK
ru_ru: БинБанк

source: Banca Intesa
ru_ru: Банк Интеза

source: Moscow Industrial Bank
ru_ru: Московский Индустриальный Банк

source: Sovcombank
ru_ru: СовКомБанк

source: National Bank TRUST
ru_ru: Национальный банк Траст

source: VTB
ru_ru: ВТБ

source: Card Halva
ru_ru: Карта Халва

source: Bank Card
ru_ru: Банковская карта

source: ElecsnetWallet
ru_ru: Кошелек Элекснет

source: QIWI Wallet
ru_ru: Киви.Кошелек

source: WMR
ru_ru: Webmoney WMR

source: Yandex.Money
ru_ru: Яндекс.Деньги

source: Beeline
ru_ru: Билайн

source: Megafon
ru_ru: Мегафон

source: Mts
ru_ru: МТС

source: Tattelecom
ru_ru: Таттелеком

source: Tele2
ru_ru: Теле2

source: Euroset
ru_ru: Евросеть

source: Svyaznoy
ru_ru: Связной

source: TerminalsElecsnet
ru_ru: Терминалы Элекснет

source: Payment gateway - Robokassa for WooCommerce
ru_ru: Платежный шлюз - Робокасса для WooCommerce

source: Integration Robokassa in WooCommerce as payment gateway.
ru_ru: Интеграция Robokassa в WooCommerce в качестве платежного шлюза.

source: Mofsy
ru_ru: Мофси
