Repository: Mofsy/wc-robokassa
Catalog: languages/wc-robokassa-*.po
Languages: ru_ru

source: Robokassa
ru_ru: Робокасса

source: Pay via Robokassa.
ru_ru: Оплата через Робокассу.

source: Support activation
ru_ru: Активация поддержки

source: The code can be obtained from the plugin website:
ru_ru: Код можно получить на сайте плагина:

source: This section will disappear after enter a valid code before the expiration of the entered code, or its cancellation.
ru_ru: Этот раздел исчезнет после ввода действительного кода до истечения срока действия введенного кода или его аннулирования.

source: Input code
ru_ru: Ввод кода

source: If enter the correct code, the current environment will be activated. Enter the code only on the actual workstation.
ru_ru: При вводе правильного кода будет активировано текущее окружение. Вводите код только на реальной рабочей станции.

source: Activate
ru_ru: Активация

source: Main settings
ru_ru: Основные настройки

source: Without these settings, the payment gateway will not work. Be sure to make settings in this block.
ru_ru: Без этих настроек платежный шлюз работать не будет. Обязательно сделайте настройки в этом блоке.

source: Main method
ru_ru: Основной метод

source: Tick the checkbox if you need to show the payment gateway.
ru_ru: Поставьте галочку, если нужно активировать платежный шлюз.

source: On disabled, the payment gateway will not be available for selection on the site. Feature useful for payments through subsidiaries, or just in case of temporary disconnection.
ru_ru: При отключении, платежный шлюз не будет доступен для выбора на сайте. Настройка полезна для платежей через дочерние методы или просто в случае временного отключения.

source: Sub methods
ru_ru: Дочерние методы

source: Tick the checkbox to enable sub methods feature. Default is disabled.
ru_ru: Установите флажок, чтобы включить дочерние методы. По умолчанию - отключены.

source: Use of all mechanisms of child payment methods. The main method can be turned off. The cart will show the child payment methods.
ru_ru: Использование всех механизмов дочерних методов оплаты. Основной метод можно отключить. В корзине будут указаны дочерние способы оплаты.

source: Shop identifier
ru_ru: Идентификатор магазина

source: Unique identifier for shop from Robokassa.
ru_ru: Уникальный идентификатор магазина из личного кабинета Робокассы.

source: Test mode
ru_ru: Тестовый режим

source: Tick the checkbox to enable test mode. Default is enabled.
ru_ru: Установите флажок, чтобы включить тестовый режим. По умолчанию включено.

source: When you activate the test mode, no funds will be debited. In this case, the payment gateway will only be displayed when you log in with an administrator account. This is done in order to protect you from false orders.
ru_ru: При активации тестового режима денежные средства списываться не будут. В этом случае платежный шлюз будет отображаться только при входе в систему с учетной записью администратора. Это делается для того, чтобы защитить вас от ложных заказов.

source: Address to notify the site of the results of operations in the background. Copy the address and enter it in your personal account ROBOKASSA in the technical settings. Notification method: POST.
ru_ru: Адрес для уведомления сайта о результатах операций в фоновом режиме. Скопируйте адрес и введите его в личном кабинете ROBOKASSA в технических настройках. Способ уведомления: POST.

source: The address for the user to go to the site after successful payment. Copy the address and enter it in your personal account ROBOKASSA in the technical settings. Notification method: POST. You can specify other addresses of your choice.
ru_ru: Адрес для перехода пользователя на сайт после успешной оплаты. Скопируйте адрес и введите его в личном кабинете ROBOKASSA в технических настройках. Способ уведомления: POST. Вы можете указать другие адреса по вашему выбору.

source: The address for the user to go to the site, after payment with an error. Copy the address and enter it in your personal account ROBOKASSA in the technical settings. Notification method: POST. You can specify other addresses of your choice.
ru_ru: Адрес для перехода пользователя на сайт, после оплаты с ошибкой. Скопируйте адрес и введите его в личном кабинете ROBOKASSA в технических настройках. Способ уведомления: POST. Вы можете указать другие адреса по вашему выбору.

source: Parameters for real payments
ru_ru: Параметры для реальных платежей

source: Passwords and hashing algorithms for real payments differ from those specified for test payments.
ru_ru: Пароли и алгоритмы хэширования для реальных платежей отличаются от тех, что указаны для тестовых платежей.

source: Hash calculation algorithm
ru_ru: Алгоритм вычисления хэша

source: The algorithm must match the one specified in the personal account of Robokassa.
ru_ru: Алгоритм должен соответствовать тому, который указан в личном кабинете Робокассы.

source: Password #1
ru_ru: Пароль #1

source: Shop pass #1 must match the one specified in the personal account of Robokassa.
ru_ru: Пароль #1 должен соответствовать тому, который указан в личном кабинете Робокассы.

source: Password #2
ru_ru: Пароль #2

source: Shop pass #2 must match the one specified in the personal account of Robokassa.
ru_ru: Пароль #2 должен соответствовать тому, который указан в личном кабинете Робокассы.

source: Parameters for test payments
ru_ru: Параметры для тестовых платежей

source: Passwords and hashing algorithms for test payments differ from those specified for real payments.
ru_ru: Пароли и алгоритмы хэширования для тестовых платежей отличаются от тех, что указаны для реальных платежей.

source: The algorithm must match the one specified in the personal account of ROBOKASSA.
ru_ru: Алгоритм должен соответствовать тому, который указан в личном кабинете Робокассы.

source: Shop pass #1 for testing payments. The pass must match the one specified in the personal account of ROBOKASSA.
ru_ru: Пароль #1 для тестовых платежей. Пароль должен соответствовать тому, который указан в личном кабинете Робокассы.

source: Shop pass #2 for testing payments. The pass must match the one specified in the personal account of ROBOKASSA.
ru_ru: Пароль #2 для тестовых платежей. Пароль должен соответствовать тому, который указан в личном кабинете Робокассы.

source: General settings for the sub methods of payment.
ru_ru: Основные настройки для дочерних методов платежа.

source: Check available via the API
ru_ru: Проверка доступности через API

source: Tick the checkbox to enable this feature. Default is disabled.
ru_ru: Установите флажок, чтобы включить эту возможность. По умолчанию отключена.

source: Check whether child methods are currently available for payment.
ru_ru: Проверять, доступны ли в настоящее время для оплаты дочерние методы.

source: Show the total amount including the fee
ru_ru: Показывать общую сумму включая комиссию

source: If you enable this option, the exact amount payable, including fees, will be added to the payment method headers.
ru_ru: Если включите этот параметр, то точная сумма, подлежащая оплате, включая сборы, будет добавлена в заголовки способов оплаты.

source: Interface
ru_ru: Интерфейс

source: Customize the appearance. Can leave it at that.
ru_ru: Настройка внешнего вида. Можете оставить все как есть.

source: Show icon?
ru_ru: Показать иконку?

source: Tick the checkbox to enable this feature. Default is enabled.
ru_ru: Установите флажок, чтобы включить эту возможность. По умолчанию включена.

source: Next to the name of the payment method will display the logo Robokassa.
ru_ru: Рядом с названием способа оплаты будет отображаться логотип Робокассы.

source: Test notification display on the test mode
ru_ru: Отображение уведомлений о тестировании в тестовом режиме

source: A notification about the activated test mode will be displayed when the payment.
ru_ru: При оплате будет выведено уведомление об активированном тестовом режиме.

source: Language interface
ru_ru: Язык интерфейса

source: Russian
ru_ru: Русский

source: English
ru_ru: Английский

source: What language interface displayed for the customer on Robokassa?
ru_ru: Какой язык показывать клиентам на стороне сервиса Робокасса?

source: Language based on the locale?
ru_ru: Язык интерфейса на основе локали?

source: Enable user language automatic detection?
ru_ru: Включить автоматическое определение языка?

source: Automatic detection of the users language from the WordPress environment.
ru_ru: Автоматическое определение языка пользователей из среды WordPress.

source: Skip the received order page?
ru_ru: Пропустить страницу полученного заказа?

source: This setting is used to reduce actions when users switch to payment.
ru_ru: Этот параметр используется для сокращения действий при переходе пользователей на оплату.

source: Title
ru_ru: Название

source: This is the name that the user sees during the payment.
ru_ru: Заголовок, который видит пользователь в процессе оформления заказа.

source: Order button text
ru_ru: Название кнопки оплаты

source: This is the button text that the user sees during the payment.
ru_ru: Название кнопки оплаты, которое видит пользователь в процессе оформления заказа.

source: Goto pay
ru_ru: Перейти к оплате

source: Description
ru_ru: Описание

source: Description of the method of payment that the customer will see on our website.
ru_ru: Описанием метода оплаты которое клиент будет видеть на вашем сайте.

source: Payment via Robokassa.
ru_ru: Оплата через Робокассу.

source: Cart content sending (54fz)
ru_ru: Отправка данных корзины (54 федеральный закон)

source: These settings are required only for legal entities in the absence of its cash machine.
ru_ru: Эти настройки обязательны только для юридических лиц при отсутствии своего кассового аппарата.

source: The transfer of goods
ru_ru: Передача товаров

source: When you select the option, a check will be generated and sent to the tax and customer. When used, you must set up the VAT of the items sold. VAT is calculated according to the legislation of the Russian Federation. There may be differences in the amount of VAT with the amount calculated by the store.
ru_ru: При выборе этого параметра чек будет сгенерирован и отправлен налоговому органу и клиенту. При использовании необходимо настроить НДС для проданных товаров. НДС рассчитывается в соответствии с законодательством Российской Федерации. Возможны расхождения в сумме НДС с суммой, рассчитанной магазином.

source: Taxation system
ru_ru: Система налогообложения

source: General
ru_ru: Общая

source: Simplified, income
ru_ru: Упрощенная, доход

source: Simplified, income minus consumption
ru_ru: Упрощенная, доход минус расход

source: Single tax on imputed income
ru_ru: Единый налог на вмененный доход

source: Single agricultural tax
ru_ru: Единый сельскохозяйственный налог

source: Patent system of taxation
ru_ru: Патентная система налогообложения

source: Default VAT rate
ru_ru: НДС по умолчанию

source: Without the vat
ru_ru: Без НДС

source: VAT 0%
ru_ru: НДС 0%

source: VAT 10%
ru_ru: НДС 10%

source: VAT 20%
ru_ru: НДС 20%

source: VAT receipt settlement rate 10/110
ru_ru: НДС рассчитанный по ставке 10/110

source: VAT receipt settlement rate 20/120
ru_ru: НДС рассчитанный по ставке 20/120

source: Indication of the calculation method
ru_ru: Указание метода расчета

source: The parameter is optional. If this parameter is not configured, the check will indicate the default value of the parameter from the Personal account.
ru_ru: Параметр является необязательным. Если этот параметр не настроен, то в чеке будет указано значение параметра по умолчанию из личного кабинета.

source: Default in Robokassa
ru_ru: По умолчанию в Робокассе

source: Prepayment 100%
ru_ru: Предоплата 100%

source: Partial prepayment
ru_ru: Частичная предоплата

source: Advance
ru_ru: Аванс

source: Full settlement
ru_ru: Полная предоплата

source: Partial settlement and credit
ru_ru: Частичный расчет и кредит

source: Transfer on credit
ru_ru: Передача в кредит

source: Credit payment
ru_ru: Платеж по кредиту

source: Sign of the subject of calculation
ru_ru: Признак предмета расчета

source: Product
ru_ru: Товар

source: Excisable goods
ru_ru: Подакцизные товары

source: Work
ru_ru: Работа

source: Service
ru_ru: Услуга

source: Gambling rate
ru_ru: Ставка на азартные игры

source: Gambling win
ru_ru: Выигрыш в азартных играх

source: Lottery ticket
ru_ru: Лотерейный билет

source: Winning the lottery
ru_ru: Выигрыш в лотерею

source: Results of intellectual activity
ru_ru: Результаты интеллектуальной деятельности

source: Payment
ru_ru: Платеж

source: Agency fee
ru_ru: Агентское вознаграждение

source: Compound subject of calculation
ru_ru: Соединение при подсчете

source: Another object of the calculation
ru_ru: Иной предмет расчета

source: Property right
ru_ru: Имущественное право собственности

source: Extraordinary income
ru_ru: Внереализационный доход

source: Insurance premium
ru_ru: Страховая премия

source: Sales tax
ru_ru: Налог с продаж

source: Resort fee
ru_ru: Курортный сбор

source: Orders notes
ru_ru: Заметки для заказов

source: Settings for adding notes to orders. All are off by default.
ru_ru: Настройки для добавления примечаний к заказам. По умолчанию все выключены.

source: Errors when verifying the signature of requests
ru_ru: Ошибки при проверке подписи запросов

source: Recording a errors when verifying the signature of requests from Robokassa.
ru_ru: Запись ошибок при проверке подписи запросов от Робокассы.

source: Process payments
ru_ru: Процесс платежей

source: Recording information about the beginning of the payment process by the user.
ru_ru: Запись информации о начале процесса оплаты пользователем.

source: Successful payments
ru_ru: Успешные оплаты

source: Recording information about received requests with successful payment.
ru_ru: Запись информации о полученных запросах с успешной оплатой.

source: Background requests
ru_ru: Фоновые запросы

source: Recording information about the background queries about transactions from Robokassa.
ru_ru: Запись информации о фоновых запросах по транзакциям от Робокассы.

source: Failed requests
ru_ru: Неудачные запросы

source: Recording information about the clients return to the canceled payment page.
ru_ru: Запись информации о возврате клиентов на страницу отмененного платежа.

source: Success requests
ru_ru: Успешные запросы

source: Recording information about the clients return to the success payment page.
ru_ru: Запись информации о возврате клиентов на страницу успешного платежа.

source: Technical details
ru_ru: Технические детали

source: Setting technical parameters. Used by technical specialists. Can leave it at that.
ru_ru: Установка технических параметров. Используется техническими специалистами. Можете оставить все как есть.

source: Logging
ru_ru: Ведение журнала

source: You can enable gateway logging, specify the level of error that you want to benefit from logging. All sensitive data in the report are deleted. By default, the error rate should not be less than ERROR.
ru_ru: Вы можете включить ведение журнала шлюза, указать уровень ошибки, который вы хотите извлечь из ведения журнала. Все конфиденциальные данные в отчете удаляются. По умолчанию частота ошибок не должна быть меньше, чем ошибка.

source: Current file:
ru_ru: Текущий файл:

source: Off
ru_ru: Отключить

source: Payment of the commission for the buyer
ru_ru: Оплата комиссии за покупателя

source: When you enable this feature, the store will pay all customer Commission costs. Works only when you select a payment method on the site and for stores individuals.
ru_ru: Когда включаете эту функцию, магазин оплачивает все комиссионные расходы за клиента. Работает только при выборе способа оплаты на сайте и для магазинов физических лиц.

source: Preliminary conversion of order currency into roubles for commission calculation
ru_ru: Предварительная конвертация валюты заказа в рубли для расчета комиссии

source: If the calculation of the customer commission is included and the order is not in roubles, the order will be converted to roubles based on data from the Central Bank of Russia. This is required due to poor Robokassa API.
ru_ru: Если расчет комиссии клиента включен и заказ не выражен в рублях, то заказ будет конвертирован в рубли на основании данных Центрального Банка России. Это необходимо из-за плохого API Робокассы.

source: Cart clearing
ru_ru: Очистка корзины

source: Clean the customers cart if payment is successful? If so, the shopping cart will be cleaned. If not, the goods already purchased will most likely remain in the shopping cart.
ru_ru: Очистить корзину клиентов, если оплата прошла успешно? Если да, корзина будет очищена. Если нет, то уже приобретенные товары скорее всего останутся в корзине.

source: Mark order as cancelled?
ru_ru: Отметить заказ как отмененный?

source: Change the status of the order to canceled when the user cancels the payment. The status changes when the user returns to the cancelled payment page.
ru_ru: Измените статус заказа на отмененный, когда пользователь отменяет платеж. Статус меняется при возврате пользователя на страницу отмененного платежа.

source: Other locations
ru_ru: Другие пункты

source: Enable for shipping methods
ru_ru: Включить для способов доставки

source: If only available for certain methods, set it up here. Leave blank to enable for all methods.
ru_ru: Если платежный метод доступен только для определенных методов доставки, установите их здесь. Оставьте пустым, чтобы включить все методы.

source: Select shipping methods
ru_ru: Выберите способы доставки

source: Return to payment gateways
ru_ru: Вернутся к платежным шлюзам

source: TEST mode is active. Payment will not be charged. After checking, disable this mode.
ru_ru: Тестовый режим активен. Оплата не взимается. После проверки, отключите этот режим.

source: The customer clicked the payment button, but an error occurred while getting the order object.
ru_ru: Клиент нажал кнопку оплаты, но при получении объекта заказа произошла ошибка.

source: The customer clicked the payment button and was sent to the side of the Robokassa.
ru_ru: Клиент нажал на кнопку оплаты и был отправлен в сторону Робокассы.

source: The customer clicked the payment button and was sent to the page of the received order.
ru_ru: Клиент нажал кнопку оплаты и был отправлен на страницу полученного заказа.

source: Order number:
ru_ru: Номер заказа:

source: Pay
ru_ru: Оплатить

source: Cancel & return to cart
ru_ru: Отменить и вернутся в корзину

source: Delivery
ru_ru: Доставка

source: Order not found.
ru_ru: Заказ не найден.

source: Robokassa request. Sum: %1$s. Signature: %2$s. Remote signature: %3$s
ru_ru: Запрос от Робокассы. Сумма: %1$s. Подпись: %2$s. Удаленная подпись: %3$s

source: Validate hash error. Local: %1$s Remote: %2$s
ru_ru: Ошибка валидации хеша. Локальный: %1$s Удаленный: %2$s

source: Order successfully paid (TEST MODE).
ru_ru: Счет успешно оплачен (ТЕСТОВЫЙ ПЛАТЕЖ)

source: Order successfully paid.
ru_ru: Счет успешно оплачен.

source: Payment error, please pay other time.
ru_ru: Ошибка платежа, пожалуйста повторите попытку позже.

source: The client returned to the payment success page.
ru_ru: Клиент вернулся на страницу успешной оплаты.

source: Order cancellation. The client returned to the payment cancellation page.
ru_ru: Отмена заказа. Клиент вернулся на страницу отмены платежа.

source: Api request error. Action not found.
ru_ru: Ошибка запроса к API. Действие не найдено.

source: The activation was not success. It may be difficult to release new updates.
ru_ru: Активация поддержки не выполнена. Возможно будет сложно выпустить новые обновления.

source: disconnected
ru_ru: отключено

source: connected
ru_ru: подключено

source: API Robokassa:
ru_ru: API Робокассы:

source: active
ru_ru: активен

source: inactive
ru_ru: неактивен

source: Test mode:
ru_ru: Тестовый режим:

source: Currency:
ru_ru: Валюта:

source: The logging level is too low. Need to increase the level after debugging.
ru_ru: Уровень логирования слишком низок. Нужно увеличить уровень после отладки.

source: Pay via Robokassa. Child method for Robokassa.
ru_ru: Оплата через Робокассу. Дочерний метод для Робокассы.

source: Work is impossible without these settings. Carefully specify the correct data.
ru_ru: Работа невозможна без этих настроек.

source: Online / Offline
ru_ru: Включено / Отключено

source: Enable display of the payment method on the website
ru_ru: Включить отображение платежного метода на сайте

source: Select the checkbox to enable this feature. Default is disabled.
ru_ru: Установите флажок, чтобы включить эту возможность. Значение по умолчанию - отключено.

source: This activation code is active.
ru_ru: Этот код активации активен.

source: Error: This activation code has expired.
ru_ru: Ошибка: Этот код активации истек.

source: Activation code republished. Awaiting reactivation.
ru_ru: Код активации переиздан. Ожидание повторной активации.

source: Error: This activation code has been suspended.
ru_ru: Ошибка: Этот код активации приостановлен.

source: This activation code is not found.
ru_ru: Указанный код активации не найден.

source: This activation code is active (localhost).
ru_ru: Этот код активации активен (localhost).

source: Error: This activation code is pending review.
ru_ru: Ошибка: Этот код активации находится на рассмотрении.

source: Error: This version of the software was released after your download access expired. Please downgrade software or contact support for more information.
ru_ru: Ошибка: Эта версия программы была выпущена после того, как истек срок доступа к загрузкам. Пожалуйста, понизьте класс программного обеспечения или свяжитесь со службой поддержки для получения более подробной информации.

source: Error: The activation code variable is empty.
ru_ru: Ошибка: Переменная кода активации пуста.

source: Error: I could not obtain a new local code.
ru_ru: Ошибка: Я не смог получить новый локальный код.

source: Error: The maximum local code delay period has expired.
ru_ru: Ошибка: Максимальный период задержки локального кода истек.

source: Error: The local key has been tampered with or is invalid.
ru_ru: Ошибка: Локальный ключ был подделан или недействителен.

source: Error: The local code is invalid for this location.
ru_ru: Ошибка: локальный код недействителен для этого места.

source: Error: Please create the following file (and directories if they dont exist already):
ru_ru: Ошибка: Пожалуйста, создайте следующий файл (и каталоги, если они еще не существуют):

source: Error: Please make the following path writable:
ru_ru: Ошибка: Пожалуйста, сделайте следующий путь доступным для записи:

source: Error: I could not determine the local key storage on clear.
ru_ru: Ошибка: Я не смог определить локальное хранилище ключей на чистоте.

source: Error: I could not save the local key.
ru_ru: Ошибка: Я не смог сохранить локальный ключ.

source: Error: The local code is invalid for this activation code.
ru_ru: Ошибка: Локальный код недействителен для указанного кода активации.

source: Error: This activation code has been deleted.
ru_ru: Ошибка: Этот код активации был удален.

source: Error: This activation code has draft.
ru_ru: Ошибка: Этот код активации имеет черновик.

source: Error: This activation code has available.
ru_ru: Ошибка: Этот код активации доступен.

source: Error: This activation code has been blocked.
ru_ru: Ошибка: Этот код активации заблокирован.

source: Official site
ru_ru: Официальная страница

source: Settings
ru_ru: Настройки

source: The plugin for accepting payments through ROBOKASSA for WooCommerce has been updated to a version that requires additional configuration.
ru_ru: Плагин для приема платежей через Робокассу для WooCommerce был обновлен до версии, требующей дополнительной настройки.

source: here
ru_ru: сюда
